/******************************************************************************
  题目: 编写一个函数，要求用户输入x的值，然后调用该函数计算多项式的值并显示该函
		数返回的值。
		
  演示: Enter a number: 2
		3x^5+2x^4-5x^3-x^2+7x-6: 92
		-----------------------------------------------------------------------
		Enter a number: 5
		3x^5+2x^4-5x^3-x^2+7x-6: 10004
		-----------------------------------------------------------------------
		Enter a number: 4
		3x^5+2x^4-5x^3-x^2+7x-6: 3270
		-----------------------------------------------------------------------
		Enter a number: 3
		3x^5+2x^4-5x^3-x^2+7x-6: 762
		-----------------------------------------------------------------------
		Enter a number: 1
		3x^5+2x^4-5x^3-x^2+7x-6: 0
		
  邮箱：mumu3w@outlook.com	
  
  时间：10/26/2015 
  
******************************************************************************/

#include <stdio.h>

int polynomial(int x);
int power(int x, int n);

int main(){
	int x;
	printf("Enter a number: ");
	scanf("%d", &x);
	
	printf("3x^5+2x^4-5x^3-x^2+7x-6: %d\n", polynomial(x));
	return 0;
}

int polynomial(int x){
	return (3 * power(x, 5) + 2 * power(x, 4) - 5 * power(x, 3) - power(x, 2) + 7 * x - 6);
}

int power(int x, int n){
	if(n == 0){
		return 1;
	}else{
		return x * power(x, n-1);
	}
}