/******************************************************************************
  题目: 提示用户输入一个数n，然后显示出1~n的所有偶数平方值。
		
  演示: Enter a number: 100
		4
		16
		36
		64
		100
		----------------------------------------------------------------------
		Enter a number: 200
		4
		16
		36
		64
		100
		144
		196
		
  邮箱：mumu3w@outlook.com	
  
  时间：10/19/2015 
  
******************************************************************************/

#include <stdio.h>

int main(){
	int n, i;
	
	printf("Enter a number: ");
	scanf("%d", &n);
	for(i = 2; i*i <= n;i += 2){
		printf("%d\n", i*i);
	}
	
	return 0;
}