/******************************************************************************
  题目: 数学常量e的值可以用一个无穷级数表示：
		e = 1+1/1!+1/2!+...
		编写程序,用下列公式计算e的近似值：
		e = 1+1/1!+1/2!+...+1/n!
		修改程序使得程序持续执行加法运算，知道当前项小于x为止。
		
  演示: Enter a number: 0.01
		e: 2.708333
		----------------------------------------------------------------------
		Enter a number: 0.001
		e: 2.718056
		----------------------------------------------------------------------
		Enter a number: 0.0001
		e: 2.718254
		
  邮箱：mumu3w@outlook.com	
  
  时间：10/19/2015 
  
******************************************************************************/

#include <stdio.h>

int main(){
	int i1, i2;
	long denom;
	float e, x;
	
	printf("Enter a number: ");
	scanf("%f", &x);

	e = 1.00f;
	for(i1 = 1; 1; i1++){
		denom = 1;
		
		for(i2 = 1; i2 <= i1; i2++){
			denom *= i2;
		}
		if(1.00f/denom < x){
			break;
		}
		e = e + 1.00f/denom;
	}
	
	printf("e: %f", e);
	
	return 0;
}

