/******************************************************************************
  题目: 测试（---i）？
		
  演示: 1.printf("---i = %d\n", -(--i));
		2.printf("---i = %d\n", --(-i));
		3.printf("---i = %d\n", ---i));
		结论三个“---”必须用空格隔开（如：- --i）；第二句是无法通过编译的,原因是
		--运算符的操作数必须是一个左值；第三句编译器(gcc、cl)解释为“--(-i)”,所
		以也是无法通过编译的。
		
  邮箱：mumu3w@outlook.com
  
  时间：10/17/2015 
  
******************************************************************************/

#include <stdio.h>

int main(){
	int i = 5;
	printf("---i = %d\n", -(--i));
	/*printf("---i = %d\n", --(-i));*/
	
	return 0;
}